Reports/АнализМинимальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>АнализМинимальныхОстатков</Name>
			<Comment>Анализ минимальных остатков</Comment>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/МинимальныеОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МинимальныеОстаткиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМаксимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТабличнойЧасти</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТабличнойЧасти</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыПеремещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыПеремещений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<Comment>Перемещение товаров между складами</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыПроизводстваВПути</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеВПути</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПотребностьВМатериалахДляМонтажа</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПутиНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеремещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправлено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобрано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииСтатусовПеремещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПеремещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ТаблицаНазначения</Name>
					<Comment>Дополнительная аналитика для автоматических документов на основании монтажей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПеремещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаОтправитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаПолучатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТаблицаНазначения</Name>
							<Comment>Дополнительная аналитика для автоматических документов на основании монтажей</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/АнализМинимальныхОстатков/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПеремещение(Команда)

	Если Не ЗначениеЗаполнено(СкладОтправитель) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Укажите склад, с которого забирается товар.'"));
		Возврат;
	КонецЕсли;

	ДанныеЗаполнения = ДанныеДляПеремещения();

	Если Не ПустаяСтрока(ДанныеЗаполнения.Ошибка) Тогда
		ПоказатьПредупреждение(, ДанныеЗаполнения.Ошибка);
		Возврат;
	КонецЕсли;

	ФормаДокумента = ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения.Шапка));

	Если ФормаДокумента = Неопределено Или Не ФормаДокумента.Открыта() Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаТовара Из ДанныеЗаполнения.Товары Цикл
		НоваяСтрока = ФормаДокумента.Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовара);
	КонецЦикла;

	ФормаДокумента.Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗначениеПараметраОтчета(ИмяПараметра)

	Параметр = Новый ПараметрКомпоновкиДанных(ИмяПараметра);

	Для Каждого Элемент Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			И Элемент.Параметр = Параметр
			И Элемент.Использование Тогда
			Возврат Элемент.Значение;
		КонецЕсли;
	КонецЦикла;

	ЭлементПараметра = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Параметр);
	Если ЭлементПараметра <> Неопределено Тогда
		Возврат ЭлементПараметра.Значение;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

&НаСервере
Функция ДанныеДляПеремещения()

	РезультатОперации = Новый Структура("Шапка, Товары, Ошибка", Неопределено, Новый Массив, "");

	ЭталонныйСклад = ЗначениеПараметраОтчета("ЭталонныйСклад");
	ДатаОтчета     = ЗначениеПараметраОтчета("ДатаОтчета");

	Если ТипЗнч(ДатаОтчета) = Тип("СтандартнаяДатаНачала") Тогда
		ДатаОтчета = ДатаОтчета.Дата;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЭталонныйСклад) Тогда
		РезультатОперации.Ошибка = НСтр("ru = 'Укажите эталонный склад в настройках отчета.'");
		Возврат РезультатОперации;
	КонецЕсли;

	Если СкладОтправитель = ЭталонныйСклад Тогда
		РезультатОперации.Ошибка = НСтр("ru = 'Склад-отправитель не должен совпадать с эталонным складом.'");
		Возврат РезультатОперации;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДатаОтчета) Тогда
		ДатаОстатков = КонецДня(ДатаОтчета);
	Иначе
		ДатаОстатков = Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапросаТоваровКПеремещению());
	Запрос.УстановитьПараметр("ЭталонныйСклад", ЭталонныйСклад);
	Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Количество() = 0 Тогда
		РезультатОперации.Ошибка = НСтр("ru = 'Нет товаров к перемещению: потребность эталонного склада закрыта
			|созданными перемещениями или на выбранном складе нет свободных остатков.'");
		Возврат РезультатОперации;
	КонецЕсли;

	Шапка = Новый Структура;
	Шапка.Вставить("СкладОтправитель", СкладОтправитель);
	Шапка.Вставить("СкладПолучатель", ЭталонныйСклад);
	Шапка.Вставить("ТекущийСтатус", Перечисления.СтатусыПеремещений.Заявка);

	ОрганизацияДокумента = ОрганизацияПоУмолчанию();
	Если ЗначениеЗаполнено(ОрганизацияДокумента) Тогда
		Шапка.Вставить("Организация", ОрганизацияДокумента);
	КонецЕсли;

	РезультатОперации.Шапка = Шапка;

	Пока Выборка.Следующий() Цикл
		СтрокаТовара = Новый Структура("Номенклатура, Количество, Коэффициент, ЕдиницаИзмерения,
			|ОстатокНаСкладе, ВРезерве, Доступно, НВД_ОстатокПолучателя, НВД_ДоступноПолучателя");
		ЗаполнитьЗначенияСвойств(СтрокаТовара, Выборка);
		СтрокаТовара.Коэффициент = 1;
		РезультатОперации.Товары.Добавить(СтрокаТовара);
	КонецЦикла;

	Возврат РезультатОперации;

КонецФункции

&НаСервереБезКонтекста
Функция ОрганизацияПоУмолчанию()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления");

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 И Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники.Организации.ПустаяСсылка();

КонецФункции

// Логика повторяет схему компоновки отчета (только проведенные документы,
// сток везде за вычетом резервов - остатков ТоварыВРезервеНаСкладах):
// Надо      = Мин(эталон) - (Сток(эталон) - Резервы(эталон))
//             - заказы поставщику на эталон в статусе "В работе" без основания;
// Перемещения (входящие на эталон) - проведенные, без основания, статусы кроме "Получен" и "Отменен";
// Забрать   = Сток(склад) - Резервы(склад) - Мин(склад) - исходящие проведенные заявки со склада
//             (статусы "Заявка" и "К сборке");
// Количество = Надо - Перемещения, но не более чем Забрать.
&НаСервереБезКонтекста
Функция ТекстЗапросаТоваровКПеремещению()

	Возврат
	"ВЫБРАТЬ
	|	МинимальныеОстатки.Номенклатура КАК Номенклатура,
	|	МинимальныеОстатки.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_МинЭталон
	|ИЗ
	|	РегистрСведений.МинимальныеОстаткиНоменклатуры КАК МинимальныеОстатки
	|ГДЕ
	|	МинимальныеОстатки.Склад = &ЭталонныйСклад
	|	И МинимальныеОстатки.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальныеОстатки.Номенклатура КАК Номенклатура,
	|	МинимальныеОстатки.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_МинОтправитель
	|ИЗ
	|	РегистрСведений.МинимальныеОстаткиНоменклатуры КАК МинимальныеОстатки
	|ГДЕ
	|	МинимальныеОстатки.Склад = &СкладОтправитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	СУММА(Остатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ ВТ_ОстаткиЭталон
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ДатаОстатков,
	|			Склад = &ЭталонныйСклад
	|				И Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал)) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	СУММА(Остатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ ВТ_ОстаткиОтправитель
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ДатаОстатков,
	|			Склад = &СкладОтправитель
	|				И Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал)) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Резервы.Номенклатура КАК Номенклатура,
	|	СУММА(Резервы.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ ВТ_РезервыОтправитель
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			&ДатаОстатков,
	|			Склад = &СкладОтправитель
	|				И Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал)) КАК Резервы
	|
	|СГРУППИРОВАТЬ ПО
	|	Резервы.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Резервы.Номенклатура КАК Номенклатура,
	|	СУММА(Резервы.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ ВТ_РезервыЭталон
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			&ДатаОстатков,
	|			Склад = &ЭталонныйСклад
	|				И Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Материал)) КАК Резервы
	|
	|СГРУППИРОВАТЬ ПО
	|	Резервы.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказПоставщикуТовары.Количество * ЗаказПоставщикуТовары.Коэффициент) КАК Количество
	|ПОМЕСТИТЬ ВТ_ПоставкиВРаботе
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка.Склад = &ЭталонныйСклад
	|	И ЗаказПоставщикуТовары.Ссылка.Проведен
	|	И ЗаказПоставщикуТовары.Ссылка.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПоставщику.ВРаботе)
	|	И НЕ ЗаказПоставщикуТовары.Ссылка.ПометкаУдаления
	|	И (ЗаказПоставщикуТовары.Ссылка.Основание = НЕОПРЕДЕЛЕНО
	|			ИЛИ ЗаказПоставщикуТовары.Ссылка.Основание = ЗНАЧЕНИЕ(Документ.Монтаж.ПустаяСсылка)
	|			ИЛИ ЗаказПоставщикуТовары.Ссылка.Основание = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ИЛИ ЗаказПоставщикуТовары.Ссылка.Основание = ЗНАЧЕНИЕ(Документ.ЗаказДоговор.ПустаяСсылка)
	|			ИЛИ ЗаказПоставщикуТовары.Ссылка.Основание = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ПеремещениеТоваровТовары.Количество * ПеремещениеТоваровТовары.Коэффициент) КАК Количество
	|ПОМЕСТИТЬ ВТ_ВходящиеПеремещения
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель = &ЭталонныйСклад
	|	И ПеремещениеТоваровТовары.Ссылка.Проведен
	|	И ПеремещениеТоваровТовары.Ссылка.ТекущийСтатус <> ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещений.Получен)
	|	И ПеремещениеТоваровТовары.Ссылка.ТекущийСтатус <> ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещений.Отменен)
	|	И НЕ ПеремещениеТоваровТовары.Ссылка.ПометкаУдаления
	|	И (ПеремещениеТоваровТовары.Ссылка.Основание = НЕОПРЕДЕЛЕНО
	|			ИЛИ ПеремещениеТоваровТовары.Ссылка.Основание = ЗНАЧЕНИЕ(Документ.Монтаж.ПустаяСсылка)
	|			ИЛИ ПеремещениеТоваровТовары.Ссылка.Основание = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ИЛИ ПеремещениеТоваровТовары.Ссылка.Основание = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровИУслуг.ПустаяСсылка)
	|			ИЛИ ПеремещениеТоваровТовары.Ссылка.Основание = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ПеремещениеТоваровТовары.Количество * ПеремещениеТоваровТовары.Коэффициент) КАК Количество
	|ПОМЕСТИТЬ ВТ_ИсходящиеЗаявки
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель = &СкладОтправитель
	|	И ПеремещениеТоваровТовары.Ссылка.Проведен
	|	И (ПеремещениеТоваровТовары.Ссылка.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещений.Заявка)
	|			ИЛИ ПеремещениеТоваровТовары.Ссылка.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещений.Собран))
	|	И НЕ ПеремещениеТоваровТовары.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчет.Номенклатура КАК Номенклатура,
	|	Расчет.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА Расчет.НадоОстаток > Расчет.ЗабратьОстаток
	|			ТОГДА Расчет.ЗабратьОстаток
	|		ИНАЧЕ Расчет.НадоОстаток
	|	КОНЕЦ КАК Количество,
	|	Расчет.ОстатокНаСкладе КАК ОстатокНаСкладе,
	|	Расчет.ВРезерве КАК ВРезерве,
	|	Расчет.ОстатокНаСкладе - Расчет.ВРезерве КАК Доступно,
	|	Расчет.ОстатокПолучателя КАК НВД_ОстатокПолучателя,
	|	Расчет.ОстатокПолучателя - Расчет.РезервПолучателя КАК НВД_ДоступноПолучателя
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_МинЭталон.Номенклатура КАК Номенклатура,
	|		ЕСТЬNULL(ВТ_ОстаткиОтправитель.Количество, 0) КАК ОстатокНаСкладе,
	|		ЕСТЬNULL(ВТ_РезервыОтправитель.Количество, 0) КАК ВРезерве,
	|		ЕСТЬNULL(ВТ_ОстаткиЭталон.Количество, 0) КАК ОстатокПолучателя,
	|		ЕСТЬNULL(ВТ_РезервыЭталон.Количество, 0) КАК РезервПолучателя,
	|		ВТ_МинЭталон.Количество - (ЕСТЬNULL(ВТ_ОстаткиЭталон.Количество, 0) - ЕСТЬNULL(ВТ_РезервыЭталон.Количество, 0)) - ЕСТЬNULL(ВТ_ВходящиеПеремещения.Количество, 0) - ЕСТЬNULL(ВТ_ПоставкиВРаботе.Количество, 0) КАК НадоОстаток,
	|		ЕСТЬNULL(ВТ_ОстаткиОтправитель.Количество, 0) - ЕСТЬNULL(ВТ_РезервыОтправитель.Количество, 0) - ЕСТЬNULL(ВТ_МинОтправитель.Количество, 0) - ЕСТЬNULL(ВТ_ИсходящиеЗаявки.Количество, 0) КАК ЗабратьОстаток
	|	ИЗ
	|		ВТ_МинЭталон КАК ВТ_МинЭталон
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиЭталон КАК ВТ_ОстаткиЭталон
	|			ПО ВТ_МинЭталон.Номенклатура = ВТ_ОстаткиЭталон.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезервыЭталон КАК ВТ_РезервыЭталон
	|			ПО ВТ_МинЭталон.Номенклатура = ВТ_РезервыЭталон.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоставкиВРаботе КАК ВТ_ПоставкиВРаботе
	|			ПО ВТ_МинЭталон.Номенклатура = ВТ_ПоставкиВРаботе.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВходящиеПеремещения КАК ВТ_ВходящиеПеремещения
	|			ПО ВТ_МинЭталон.Номенклатура = ВТ_ВходящиеПеремещения.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиОтправитель КАК ВТ_ОстаткиОтправитель
	|			ПО ВТ_МинЭталон.Номенклатура = ВТ_ОстаткиОтправитель.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезервыОтправитель КАК ВТ_РезервыОтправитель
	|			ПО ВТ_МинЭталон.Номенклатура = ВТ_РезервыОтправитель.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МинОтправитель КАК ВТ_МинОтправитель
	|			ПО ВТ_МинЭталон.Номенклатура = ВТ_МинОтправитель.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсходящиеЗаявки КАК ВТ_ИсходящиеЗаявки
	|			ПО ВТ_МинЭталон.Номенклатура = ВТ_ИсходящиеЗаявки.Номенклатура) КАК Расчет
	|ГДЕ
	|	Расчет.НадоОстаток > 0
	|	И Расчет.ЗабратьОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Расчет.Номенклатура.Наименование";

КонецФункции

#КонецОбласти
